OpenFOAM/libAcoustics/libAcoustics-OF4.1/cases/FFWH+cfdbem_1D/0/cyc
    "(cyc1|cyc2|cyc3|cyc4)"
    {
        type            wedge;
    }

